package cons

// RobotStatusMap 状态枚举 https://www.bfvrobot.net/js/4.js
var RobotStatusMap = map[int]string{
	-2: "查询失败",
	-1: "无记录",
	0:  "数据正常",
	1:  "举报证据不足[无效举报]",
	2:  "武器数据异常",
	3:  "全局黑名单[嫌疑或实锤]",
	4:  "全局白名单[刷枪或其它自证]",
	5:  "全局白名单[Moss自证]",
	6:  "当前数据正常(曾经有武器数据异常记录)",
	7:  "全局黑名单[服主添加]",
	8:  "永久全局黑名单[涉及底线的问题]",
	9:  "全局黑名单[辱华涉政]",
	10: "全局黑名单[检查组添加]",
	11: "全局黑名单[不受欢迎的玩家]",
	12: "全局黑名单[机器人自动反外挂]",
	13: "全局黑名单[社区举报(武器数据异常)",
	14: "全局黑名单[社区举报(BTR异常)",
	15: "临时白名单[自证]",
}

const PlayerNotFound = "未找到玩家: player not found"
